gpe-config.org
#+title: gpe-config
#+author: Ethan Lin
#+date: <2023-10-17 Tue>

#+startup: overview

* GPE Configuration Development
** early-init.el
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:
*** early-init.el header
#+begin_src emacs-lisp
  ;;; early-init.el --- Early initialisation. -*- lexical-binding: t -*-
  ;;
  ;; Copyleft (CL) 2018-2028 YF Lin
  ;;
  ;; Something good as indicated, by Dr YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org
  ;;----------------------------------------------------------------------
  ;;; Commentary:
  ;; Emacs 27 introduces early-init.el, which is run before init.el,
  ;; before package and UI initialisation happens.
  ;; Emacs 29 supports native compilation.
  ;;----------------------------------------------------------------------
  ;;; Code:
#+end_src

*** early-init body
#+begin_src emacs-lisp
  ;; Debugging for the setting update.
  (setq debug-on-error nil)

  (when init-file-debug
    (profiler-start 'cpu)
    (add-hook 'window-setup-hook #'profiler-stop 0))

  ;; Puremacs is compatible from the emacs version 27.1.
  (let ((minver "28.2"))
    (when (version< emacs-version minver)
      (error "The GPE requires V%s or higher versions" minver)))

  ;; Garbage collection in the startup process
  ;; (setq gc-cons-threshold most-positive-fixnum
  ;;       gc-cons-percentage 0.5)
  ;; (add-hook 'after-init-hook #'(lambda () (setq gc-cons-threshold 800000)))
  (setq gc-cons-threshold most-positive-fixnum)
  (setq gc-cons-percentage 0.5)

  ;; Prevent unwanted run-time compilation for native-comp users
  (when (>= emacs-major-version 29)
    (setq inhibit-automatic-native-compilation nil))

  ;; Suppress a second case-insensitive search through the auto-mode-alist
  (setq auto-mode-case-fold nil)

  ;; access through mini-buffer
  (setq use-file-dialog nil)

  ;; After early-init-file to initialise 'package'. Make initialisation
  ;; slightly faster See the (package-initialize) in the file
  ;; init-0-bridge.el, which make the initiation will be executed just
  ;; once.
  (setq package-enable-at-startup nil)
  ;; Prevent loading from the package cache (same reason).
  (setq package-quickstart nil)

  ;; In noninteractive sessions, prioritise non-byte-compiled source
  ;; files to prevent the use of stale byte-code. Otherwise, it saves us
  ;; a little IO time to skip the time checks on every *.elc file.
  ;; from Doom Emacs
  (setq load-prefer-newer noninteractive)

  ;; Inhibit resizing Puremacs frame
  (setq frame-inhibit-implied-resize t)

  ;; Remove some warnings
  (setq byte-compile-warnings nil)

  ;; Default settings for the frame before initialisation
  ;; To prevent the glimpse of un-styled Emacs by disabling the following UI elements early.
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (when (featurep 'ns)
    (push '(ns-transparent-titlebar . t) default-frame-alist))

  ;; not compile on this stage
  ;; (setq comp-deferred-compilation nil)

  ;; Turn off the startup help screen
  (setq inhibit-splash-screen t)

  ;; Prevent flash of un-styled modeline at startup
  (setq-default mode-line-format nil)
  (fset 'display-startup-echo-area-message 'ignore)
#+end_src

*** early-init footer
#+begin_src emacs-lisp  
  ;;-------------------------------------------------------------------------------------------------
  ;;; early-init.el ends here.
#+end_src

** site-lisp
*** pure-const.el
:PROPERTIES:
:HEADER-ARGS: :tangle site-lisp/pure-const.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; pure-const.el -- Better default configurations. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Define constants.
  ;;--------------------------------------------------------------------
  ;;; Code:

  (defvar *is-mac* (eq system-type 'darwin) "Current system is mac.")
  (defvar *is-win* (eq system-type 'windows-nt) "Current system is windows.")
  (defvar *is-nux* (or (eq system-type 'gnu/linux) (eq system-type 'linux)) "Current system is gnu/linux.")

  (defconst ThingsEngine-homepage
    "https://thethingsengine.org"
    "The webpage of ThingsEngine.")

  (defconst puremacs-custom-example-file
    (expand-file-name "custom-example.el" user-emacs-directory)
    "Custom example file of Pure Emacs.")

  (defconst puremacs-custom-post-file
    (expand-file-name "custom-post.el" user-emacs-directory)
    "Custom file after startup.
  Put private configurations to override defaults here.")

  (defconst puremacs-custom-post-org-file
    (expand-file-name "custom-post.org" user-emacs-directory)
    "Custom org file after startup.
  Put private configurations to override defaults here.
  Loaded by `org-babel-load-file'.")

  (defconst sys/win32p
    (eq system-type 'windows-nt)
    "Are we running on a WinTel system?")

  (defconst sys/linuxp
    (eq system-type 'gnu/linux)
    "Are we running on a GNU/Linux system?")

  (defconst sys/macp
    (eq system-type 'darwin)
    "Are we running on a Mac system?")

  (defconst sys/mac-x-p
    (and (display-graphic-p) sys/macp)
    "Are we running under X on a Mac system?")

  (defconst sys/mac-ns-p
    (eq window-system 'ns)
    "Are we running on a GNUstep or Macintosh Cocoa display?")

  (defconst sys/mac-cocoa-p
    (featurep 'cocoa)
    "Are we running with Cocoa on a Mac system?")

  (defconst sys/mac-port-p
    (eq window-system 'mac)
    "Are we running a macport build on a Mac system?")

  (defconst sys/linux-x-p
    (and (display-graphic-p) sys/linuxp)
    "Are we running under X on a GNU/Linux system?")

  (defconst sys/cygwinp
    (eq system-type 'cygwin)
    "Are we running on a Cygwin system?")

  (defconst sys/rootp
    (string-equal "root" (getenv "USER"))
    "Are you using ROOT user?")

  (defconst emacs/>=25p
    (>= emacs-major-version 25)
    "Emacs is 25 or above.")

  (defconst emacs/>=26p
    (>= emacs-major-version 26)
    "Emacs is 26 or above.")

  (defconst emacs/>=25.2p
    (or emacs/>=26p
        (and (= emacs-major-version 25)
             (>= emacs-minor-version 2)))
    "Emacs is 25.2 or above.")

  (defconst emacs/>=25.3p
    (or emacs/>=26p
        (and (= emacs-major-version 25)
             (>= emacs-minor-version 3)))
    "Emacs is 25.3 or above.")

  (defconst emacs/>=27p
    (>= emacs-major-version 27)
    "Emacs is 27 or above.")

  (defconst emacs/>=28p
    (>= emacs-major-version 28)
    "Emacs is 28 or above.")

  (defconst emacs/>=29p
    (>= emacs-major-version 29)
    "Emacs is 29 or above.")

  ;;-------------------------------------------------------------------------------------------------
  (provide 'pure-const)
  ;;; init-const.el ends here

  ;;;;;; Example: Switch Git Bash
  ;; (when *is-win*
  ;;   (setq explicit-shell-file-name
  ;;         "C:/Program Files/Git/bin/bash.exe")
  ;;   (setq shell-file-name explicit-shell-file-name)
  ;;   (add-to-list 'exec-path "C:/Program Files/Git/bin")
  ;;   )
#+end_src

*** pure-custom.el
:PROPERTIES:
:HEADER-ARGS: :tangle site-lisp/pure-custom.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; pure-custom.el --- Custom set varaiables by hand. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Setting variables by hand
  ;;--------------------------------------------------------------------
  ;;; Code:

  (when *is-mac*
    (set-face-attribute 'default nil :font "Menlo-16" ))


  ;; Add when is-a-mac.
  ;; ExecPath: https://www.emacswiki.org/emacs/ExecPath
  (when *is-mac*
    (setenv "PATH" (concat (getenv "PATH") ":/opt/homebrew/bin"))
    (setq exec-path (append exec-path '("/opt/homebrew/bin"))))


  ;; (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  ;; (add-to-list 'default-frame-alist '(ns-appearance . dark))

  (add-to-list 'default-frame-alist '(drag-internal-border . 1))
  (add-to-list 'default-frame-alist '(internal-border-width . 5))

  ;;-------------------------------------------------------------------------------------------------
  (provide 'pure-custom)
  ;;; init-custom.el ends here
#+end_src
