lisp/init-a-authentication.el
;;; init-a-authentication.el -- Authentication for General Pure Emacs -*- lexical-binding: t; -*-
;;
;; Copyleft (CL) 2022-2032 YF Lin
;;
;; Something good as indicated, by Dr YF Lin <e.yflin@gmail.com>
;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
;; Under ThingsEngine Project: https://www.thethingsengine.org
;;--------------------------------------------------------------------
;;; Commentary:
;; reserve for authentication
;;--------------------------------------------------------------------
;;; Code:


;;--------------------------------------------------------------------
(provide 'init-a-authentication)
;;; init-a-authentication.el ends here.
