gpe-config.org
*** init-l-markdown.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-l-markdown.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;;init-l-markdown.el --- minibuffer -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 YF Lin
  ;;
  ;; Something good as indicated, by Dr YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;;
  ;; Markdown configurations from Centaur Emacs By Vincent Zhang
  ;;
  ;;; Code:

  (use-package markdown-mode
    :mode (("README\\.md\\'" . gfm-mode))
    :init
    (setq markdown-enable-wiki-links t
          markdown-italic-underscore t
          markdown-asymmetric-header t
          markdown-make-gfm-checkboxes-buttons t
          markdown-gfm-uppercase-checkbox t
          markdown-fontify-code-blocks-natively t

          markdown-content-type "application/xhtml+xml"
          markdown-css-paths '("https://cdn.jsdelivr.net/npm/github-markdown-css/github-markdown.min.css"
                               "https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/styles/github.min.css")
          markdown-xhtml-header-content "
  <meta name='viewport' content='width=device-width, initial-scale=1, shrink-to-fit=no'>
  <style>
  body {
    box-sizing: border-box;
    max-width: 740px;
    width: 100%;
    margin: 40px auto;
    padding: 0 10px;
  }
  </style>

  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/styles/default.min.css'>
  <script src='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/highlight.min.js'></script>
  <script>
  document.addEventListener('DOMContentLoaded', () => {
    document.body.classList.add('markdown-body');
    document.querySelectorAll('pre code').forEach((code) => {
      if (code.className != 'mermaid') {
        hljs.highlightBlock(code);
      }
    });
  });
  </script>

  <script src='https://unpkg.com/mermaid@8.4.8/dist/mermaid.min.js'></script>
  <script>
  mermaid.initialize({
    theme: 'default',  // default, forest, dark, neutral
    startOnLoad: true
  });
  </script>
  "
          markdown-gfm-additional-languages "Mermaid")

    ;; `multimarkdown' is necessary for `highlight.js' and `mermaid.js'
    (when (executable-find "multimarkdown")
      (setq markdown-command "multimarkdown"))
    :config
    ;; Support `mermaid'
    (add-to-list 'markdown-code-lang-modes '("mermaid" . mermaid-mode))

    (with-no-warnings
      ;; Use `which-key' instead
      (advice-add #'markdown--command-map-prompt :override #'ignore)
      (advice-add #'markdown--style-map-prompt   :override #'ignore)

      ;; Preview with built-in webkit
      (defun my-markdown-export-and-preview (fn)
        "Preview with `xwidget' if applicable, otherwise with the default browser."
        (if (featurep 'xwidget-internal)
            (centaur-webkit-browse-url (concat "file://" (markdown-export)) t)
          (funcall fn)))
      (advice-add #'markdown-export-and-preview :around #'my-markdown-export-and-preview))

    ;; Preview via `grip'
    ;; Install: pip install grip
    (use-package grip-mode
      :defines org-mode-map
      :bind (:map markdown-mode-command-map
                  ("g" . grip-mode))
      :init
      (with-eval-after-load 'org
        (bind-key "C-c C-g" #'grip-mode org-mode-map))

      (setq grip-update-after-change nil)
      (when-let ((credential (auth-source-user-and-password "api.github.com")))
        (setq grip-github-user (car credential)
              grip-github-password (cadr credential))))

    ;; Table of contents
    (use-package markdown-toc
      :diminish
      :bind (:map markdown-mode-command-map
                  ("r" . markdown-toc-generate-or-refresh-toc))
      :hook (markdown-mode . markdown-toc-mode)
      :init (setq markdown-toc-indentation-space 2
                  markdown-toc-header-toc-title "\n## Table of Contents"
                  markdown-toc-user-toc-structure-manipulation-fn 'cdr)
      :config
      (with-no-warnings
        (define-advice markdown-toc-generate-toc (:around (fn &rest args) lsp)
          "Generate or refresh toc after disabling lsp."
          (cond
           ((bound-and-true-p lsp-managed-mode)
            (lsp-managed-mode -1)
            (apply fn args)
            (lsp-managed-mode 1))
           ((bound-and-true-p eglot--manage-mode)
            (eglot--manage-mode -1)
            (apply fn args)
            (eglot--manage-mode 1))
           (t
            (apply fn args)))))))
  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-l-markdown)
  ;;;init-l-markdown ends here
#+end_src

*** init-p-cpp.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-p-cpp.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-p-cpp.el --- Settings for C/C++. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Configurations for C/C++ programming
  ;;--------------------------------------------------------------------
  ;;; Code:

  (use-package eglot
    :ensure t
    :config
    ;(require 'eglot)
    (add-to-list 'eglot-server-programs '((c++-mode c-mode) "clangd"))
    (add-hook 'c-mode-hook #'eglot-ensure)
    (add-hook 'c++-mode-hook #'eglot-ensure))

  (use-package quickrun
      :ensure t
      :commands (quickrun)
      :config
      (quickrun-add-command "c++/c1z"
      '((:command . "g++")
      (:exec . ("%c -std=c++1z %o -o %e %s"
          "%e %a"))
      (:remove . ("%e")))
      :default "c++")
      :bind ("<f5>" . quickrun))

  ;; (global-set-key (kbd "<f5>") 'quickrun)

  ;;--------------------------------------------------------------------------------------------------
  (provide 'init-p-cpp)
  ;;; init-p-cpp.el ends here
#+end_src

*** init-p-julia.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-p-julia.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-p-julia.el --- Settings for Julia. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Configurations for Julia programming
  ;;--------------------------------------------------------------------
  ;;; Code:

  (use-package julia-mode
    :ensure t)

  (use-package julia-repl
    :ensure t
    :hook (julia-mode . julia-repl-mode))

  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-p-julia)
  ;;; init-p-julia.el ends here.
#+end_src

*** init-p-lua.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-p-lua.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-p-lua.el -- For lua programming language. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Configurations for lua programming language for Neovim settings
  ;;--------------------------------------------------------------------
  ;;; Code:

  (use-package lua-mode
    :ensure t
    :magic ("\\.lua$" . lua-mode)
    :config
    (add-to-list 'interpreter-mode-alist '("lua" . lua-mode)))

  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-p-lua)
  ;;; init-p-lua.el ends here.
#+end_src

