gpe-config.org
*** init-p-python.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-p-python.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-p-python.el --- Settings for Python. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Configurations for Python programming
  ;;--------------------------------------------------------------------
  ;;; Code:

  (use-package python
    :ensure nil
    :hook (inferior-python-mode . (lambda ()
                                    (process-query-on-exit-flag
                                     (get-process "Python"))))
    :init
    (setq python-shell-completion-native-enable t)
    :config
    ;; Default to python3, differ from python2.
    (setq python-indent-offset 4)
    (when (and (executable-find "python3")
               (string= python-shell-interpreter "python3"))
      (setq python-shell-interpreter "python3")))

  ;; Live Coding in Python
  (use-package live-py-mode
    :ensure t)

  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-p-python)
  ;;; init-p-python.el ends here
#+end_src

*** init-p-treesit.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-p-treesit.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-p-treesit.el --- for testing purposes  -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 YF Lin
  ;;
  ;; Something good as indicated, by Dr YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; treesit for programming purposes
  ;;--------------------------------------------------------------------
  ;;; Code:

  (require 'treesit)

  ;; M-x `treesit-install-language-grammar` to install language grammar.
  (setq treesit-language-source-alist
        '((bash . ("https://github.com/tree-sitter/tree-sitter-bash"))
          (c . ("https://github.com/tree-sitter/tree-sitter-c"))
          (cpp . ("https://github.com/tree-sitter/tree-sitter-cpp"))
          (css . ("https://github.com/tree-sitter/tree-sitter-css"))
          (cmake . ("https://github.com/uyha/tree-sitter-cmake"))
          (csharp     . ("https://github.com/tree-sitter/tree-sitter-c-sharp.git"))
          (dockerfile . ("https://github.com/camdencheek/tree-sitter-dockerfile"))
          (elisp . ("https://github.com/Wilfred/tree-sitter-elisp"))
          (go . ("https://github.com/tree-sitter/tree-sitter-go"))
          (gomod      . ("https://github.com/camdencheek/tree-sitter-go-mod.git"))
          (html . ("https://github.com/tree-sitter/tree-sitter-html"))
          (java       . ("https://github.com/tree-sitter/tree-sitter-java.git"))
          (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript"))
          (json . ("https://github.com/tree-sitter/tree-sitter-json"))
          (lua . ("https://github.com/Azganoth/tree-sitter-lua"))
          (make . ("https://github.com/alemuller/tree-sitter-make"))
          (markdown . ("https://github.com/MDeiml/tree-sitter-markdown" nil "tree-sitter-markdown/src"))
          (ocaml . ("https://github.com/tree-sitter/tree-sitter-ocaml" nil "ocaml/src"))
          (org . ("https://github.com/milisims/tree-sitter-org"))
          (python . ("https://github.com/tree-sitter/tree-sitter-python"))
          (php . ("https://github.com/tree-sitter/tree-sitter-php"))
          (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" nil "typescript/src"))
          (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" nil "tsx/src"))
          (ruby . ("https://github.com/tree-sitter/tree-sitter-ruby"))
          (rust . ("https://github.com/tree-sitter/tree-sitter-rust"))
          (sql . ("https://github.com/m-novikov/tree-sitter-sql"))
          (vue . ("https://github.com/merico-dev/tree-sitter-vue"))
          (yaml . ("https://github.com/ikatyang/tree-sitter-yaml"))
          (toml . ("https://github.com/tree-sitter/tree-sitter-toml"))
          (zig . ("https://github.com/GrayJack/tree-sitter-zig"))))

  (setq major-mode-remap-alist
        '((c-mode          . c-ts-mode)
          (c++-mode        . c++-ts-mode)
          (cmake-mode      . cmake-ts-mode)
          (conf-toml-mode  . toml-ts-mode)
          (css-mode        . css-ts-mode)
          (js-mode         . js-ts-mode)
          (js-json-mode    . json-ts-mode)
          (python-mode     . python-ts-mode)
          (sh-mode         . bash-ts-mode)
          (typescript-mode . typescript-ts-mode)
          (rust-mode       . rust-ts-mode)
          (java-mode       . java-ts-mode)
          ))

  (add-hook 'markdown-mode-hook #'(lambda () (treesit-parser-create 'markdown)))

  (add-hook 'zig-mode-hook #'(lambda () (treesit-parser-create 'zig)))

  (add-hook 'web-mode-hook #'(lambda ()
                               (let ((file-name (buffer-file-name)))
                                 (when file-name
                                   (treesit-parser-create
                                    (pcase (file-name-extension file-name)
                                      ("vue" 'vue)
                                      ("html" 'html)
                                      ("php" 'php))))
                                 )))

  (add-hook 'emacs-lisp-mode-hook #'(lambda () (treesit-parser-create 'elisp)))
  (add-hook 'ielm-mode-hook #'(lambda () (treesit-parser-create 'elisp)))
  (add-hook 'json-mode-hook #'(lambda () (treesit-parser-create 'json)))
  (add-hook 'go-mode-hook #'(lambda () (treesit-parser-create 'go)))
  (add-hook 'java-mode-hook #'(lambda () (treesit-parser-create 'java)))
  (add-hook 'java-ts-mode-hook #'(lambda () (treesit-parser-create 'java)))
  (add-hook 'php-mode-hook #'(lambda () (treesit-parser-create 'php)))
  (add-hook 'php-ts-mode-hook #'(lambda () (treesit-parser-create 'php)))
  (add-hook 'java-ts-mode-hook #'(lambda () (treesit-parser-create 'java)))

  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-p-treesit)
  ;;;init-treesit ends here
#+end_src

*** init-p-web.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-p-web.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-p-ts.el --- Settings for Typecript. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Configurations for Web programming
  ;;--------------------------------------------------------------------
  ;;; Code:

  ;; Tide, TypeScript Interactive Development Environment for Emacs: https://github.com/ananthakumaran/tide/
  ;; ts-comint, a Typescript REPL in Emacs: https://github.com/emacs-typescript/typescript.el
  (use-package typescript-mode
    :ensure t
    :mode ("\\.ts[x]\\'" . typescript-mode))

  (use-package json-mode
    :ensure t)

  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-p-web)
  ;;; init-p-web.el ends here
#+end_src

