gpe-config.org
*** init-r-research.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-r-research.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-r-research.el --- Setup for research. -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Configurations for research
  ;;--------------------------------------------------------------------
  ;;; Code:

  (when (version< "27.2" emacs-version)
    (use-package obsidian
      :ensure t
      :config
      (defvar GPE-research (expand-file-name "GPE-Org/research/" user-emacs-directory))
      (unless (file-exists-p GPE-research)
        (make-directory GPE-research))
      (obsidian-specify-path GPE-research)
      (global-obsidian-mode t)
      :custom
      ;; This directory will be used for `obsidian-capture' if set.
      (obsidian-inbox-directory "Inbox")
      :bind (:map obsidian-mode-map
                  ;; Replace C-c C-o with Obsidian.el's implementation. It's ok to use another key binding.
                  ("C-c C-o" . obsidian-follow-link-at-point)
                  ;; Jump to backlinks
                  ("C-c C-b" . obsidian-backlink-jump)
                  ;; If you prefer you can use `obsidian-insert-link'
                  ("C-c C-l" . obsidian-insert-wikilink))))

  ;;--------------------------------------------------------------------
  (use-package zotxt
    :ensure t
    :hook
    (org-mode . org-zotxt-mode))

  ;;--------------------------------------------------------------------
  ;; Emacs for Overleaf
  (use-package atomic-chrome
    :ensure t
    :config ; :init
    (atomic-chrome-start-server))

  (use-package ess
    :ensure t)

  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-r-research)
  ;;; init-r-research.el ends here
#+end_src

*** init-r-roam.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-r-roam.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;;; init-r-roam.el -- Setting for roam -*- lexical-binding: t; -*-
  ;;
  ;; Copyleft (CL) 2022-2032 Dr YF Lin
  ;;
  ;; Author: Ethan YF Lin <e.yflin@gmail.com>
  ;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
  ;; Under ThingsEngine Project: https://www.thethingsengine.org/
  ;;--------------------------------------------------------------------
  ;;; Commentary:
  ;; Configurations for roam research
  ;;--------------------------------------------------------------------
  ;;; Code:
  (use-package org-roam
    :ensure t
    :init
    (defvar GPE-roam (expand-file-name "GPE-Org/roam/" user-emacs-directory))
    (unless (file-directory-p GPE-roam)
      (make-directory GPE-roam))
    :custom
    (org-roam-directory (file-truename GPE-roam))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture)
           ;; Dailies
           ("C-c n j" . org-roam-dailies-capture-today))
    :config
    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-autosync-mode)
    ;; If using org-roam-protocol
    (require 'org-roam-protocol)
    (when emacs/>=27p
      (use-package org-roam-ui
        :ensure t
        :init
        (when (featurep 'xwidget-internal)
          (setq org-roam-ui-browser-function #'xwidget-webkit-browse-url)))))

  ;;-------------------------------------------------------------------------------------------------
  (provide 'init-r-roam)
  ;;; init-r-roam.el ends here.
#+end_src

