lisp/init-z-test.el
;;; init-z-test.el --- for testing purposes  -*- lexical-binding: t; -*-
;;
;; Copyleft (CL) 2022-2032 YF Lin
;;
;; Something good as indicated, by Dr YF Lin <e.yflin@gmail.com>
;; URL: https://github.com/Ethanlinyf/General-Pure-Emacs
;; Under ThingsEngine Project: https://www.thethingsengine.org
;;--------------------------------------------------------------------
;;; Commentary:
;; For debugging and testing purposes
;;--------------------------------------------------------------------
;;; Code:

;; (setq debug-on-error t)

;;-------------------------------------------------------------------------------------------------
(provide 'init-z-test)
;;; init-z-test.el ends here
